# -*- mode: org; buffer-read-only: t; coding: utf-8; org-image-actual-width: nil; eval: (setq-local css-path (expand-file-name ".utils/css/org.css" user-emacs-directory)); -*-
#+STARTUP: content align inlineimages indent hidestars
#+PROPERTY: header-args :eval never :mkdirp yes
#+OPTIONS: html-postamble:nil
#+OPTIONS: ':t *:t -:t ::t <:t H:5 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:nil d:(not LOGBOOK) date:t e:t email:nil f:t inline:t
#+OPTIONS: *:nil toc:t num:nil
#+OPTIONS: todo:t |:t tex:t
#+DESCRIPTION: ORG JOURNAL Recording
#+LANGUAGE: en
#+PROPERTY: header-args :eval yes
#+STARTUP: overview

*** csv to org table test demo
#+BEGIN_SRC elisp :results raw
(xlsx-to-org-table-string "C:/Users/<user_name>/Downloads/elisp.xlsx")
#+END_SRC

#+results:
| category          | form_or_cmd                               | description_zh                 | notes                             |
|-------------------+-------------------------------------------+--------------------------------+-----------------------------------|
| 基本操作           | (message "Hello %s" "world")              | 在 echo-area 输出字符串          | 格式化输出                         |
| 基本操作           | (prin1-to-string 123)                     | 将对象转成字符串                 | 常用于调试                         |
| 基本操作           | (read-from-minibuffer "Input: ")          | 从 minibuffer 读取字符串         |                                   |
| 执行与求值         | (eval-expression)                         | M-: 在 minibuffer 里求值表达式   |                                   |
| 执行与求值         | (eval-region)                             | 对选中区域求值                   | C-M-x 在 Lisp buffer 对 defun 求值 |
| 执行与求值         | (load "file")                             | 加载 elisp 文件                 | 可选第三参不报错,第四参避免 message   |
| 执行与求值         | (require 'cl-lib)                         | 按特性加载库                     | 返回 t                            |
| 执行与求值         | (provide 'feature)                        | 声明当前文件提供的特性            |                                   |
| 变量 & 赋值        | (setq x 10)                               | 设置动态变量                     |                                   |
| 变量 & 赋值        | (let ((x 1) (y 2)) ...)                   | 创建临时绑定                     | 动态作用域                         |
| 变量 & 赋值        | (defconst pi 3.14)                        | 定义常量                        |                                   |
| 变量 & 赋值        | (defvar user-name "me")                   | 若未绑定就初始化                 |                                   |
| 函数定义           | (defun square (x) (* x x))                | 定义函数                        |                                   |
| 函数定义           | (defalias 'sq 'square)                    | 给函数取别名                     |                                   |
| 函数定义           | (lambda (x) (* x x))                      | 匿名函数                        |                                   |
| 交互式命令         | (interactive)                             | 让函数成为 M-x 可调用命令         |                                   |
| 交互式命令         | (interactive "sName: ")                   | 指定 minibuffer 提示并读取       |                                   |
| 控制流             | (when cond body...)                       | 真时执行                        |                                   |
| 控制流             | (unless cond body...)                     | 假时执行                        |                                   |
| 控制流             | (if cond then else)                       | 条件分支                        |                                   |
| 控制流             | (cond (test1 res1) (t default))           | 多分支                          |                                   |
| 迭代              | (dotimes (i 10) ...)                      | 对整数 i 迭代                   |                                   |
| 迭代              | (dolist (x list) ...)                     | 遍历列表                        |                                   |
| 布尔与比较         | (eq a b)                                  | 比较符号是否同一                 |                                   |
| 布尔与比较         | (equal a b)                               | 深度比较                        |                                   |
| 布尔与比较         | (= n m)                                   | 数值相等                        |                                   |
| 列表操作           | (car list)                                | 取首元素                        |                                   |
| 列表操作           | (cdr list)                                | 取尾部                          |                                   |
| 列表操作           | (cons x xs)                               | 构造新列表                      |                                   |
| 列表操作           | (append l1 l2)                            | 连接列表                        | 支持多实参                         |
| 列表操作           | (nth 2 list)                              | 取第 n 项(从 0)                 |                                   |
| 列表操作           | (length list)                             | 求长度                          |                                   |
| 字符串             | (concat "a" "b")                          | 拼接字符串                      |                                   |
| 字符串             | (substring "abc" 1 2)                     | 截取子串,得 "b"                 |                                   |
| 字符串             | (format "Hello %s" "you")                 | 格式化                          |                                   |
| 向量 & 数组        | (aref [1 2 3] 0)                          | 向量取值                        | C语言式下标                        |
| 向量 & 数组        | (aset vec idx val)                        | 向量赋值                        |                                   |
| 散列表             | (make-hash-table :test 'equal)            | 创建哈希表                      |                                   |
| 散列表             | (puthash key val table)                   | 写入                           |                                   |
| 散列表             | (gethash key table default)               | 读取                           |                                   |
| 符号 & 属性        | (symbol-value 'x)                         | 取符号值                        |                                   |
| 符号 & 属性        | (set 'x 42)                               | 通过符号设置值                   |                                   |
| 符号 & 属性        | (symbol-plist 'x)                         | 属性列表                        |                                   |
| 宏                | (defmacro when* (c &rest b) `(if          | c (progn                       | @b)))                             |
| 宏                | (macroexpand '(when* t 1 2))              | 展开宏                          |                                   |
| 缓冲区 & 文件      | (current-buffer)                          | 返回当前 buffer 对象             |                                   |
| 缓冲区 & 文件      | (find-file "foo.el")                      | 在当前窗口打开文件                |                                   |
| 缓冲区 & 文件      | (save-buffer)                             | 保存文件                        |                                   |
| 缓冲区 & 文件      | (with-temp-buffer ...)                    | 创建临时 buffer                 |                                   |
| 窗口管理           | (split-window-right)                      | (C-x 3) 垂直分窗                |                                   |
| 窗口管理           | (other-window 1)                          | (C-x o) 切到下一窗口             |                                   |
| 查找 & 替换        | (search-forward "str")                    | 向前查找                        |                                   |
| 查找 & 替换        | (replace-string "old" "new")              | 字符串替换                      |                                   |
| 键盘映射           | (global-set-key (kbd "C-c g") #'grep)     | 全局绑键                        |                                   |
| 键盘映射           | (define-key map (kbd "q") #'quit-window)  | 对键盘宏绑定                     |                                   |
| 文件 I/O          | (insert-file-contents "README.md")        | 把文件内容插入当前缓冲区           |                                   |
| 字节编译           | (byte-compile-file "foo.el")              | 将 elisp 编译成 .elc            |                                   |
| 建议(Advice)      | (advice-add 'find-file :after #'my-log)   | 在函数后附加行为                 |                                   |
| 建议(Advice)      | (advice-remove 'find-file #'my-log)       | 移除 advice                    |                                   |
| 错误处理           | (condition-case err body (error handler)) | 捕获异常                        |                                   |
| Timer & idle      | (run-at-time "5 sec" nil #'message "Hi")  | 一次性计时器                     |                                   |
| Timer & idle      | (run-with-idle-timer 2 nil #'save-buffer) | 空闲时执行                      |                                   |
| 进程              | (start-process "name" "*buf*" "cmd" "arg")  | 后台进程                        |                                   |
| 进程              | (process-send-string proc "input")        | 写入进程                        |                                   |
| 外部调用           | (shell-command-to-string "ls")            | 获取 shell 命令输出              |                                   |
| 包管理             | (package-refresh-contents)                | 刷新 ELPA 索引                  |                                   |
| 包管理             | (package-install 'use-package)            | 安装包                          | use-package 常用                  |
| Org 相关          | (org-babel-tangle)                        | 抽取源码块生成文件                |                                   |
| Org 相关          | (org-agenda)                              | 打开 agenda 视图                |                                   |
| 补全 & Minibuffer | (completing-read "Pick: " '("a" "b"))     | 从列表补全                      |                                   |
| 项目 & 文件树      | (project-current)                         | 返回当前项目                     |                                   |
| 项目 & 文件树      | (project-files proj)                      | 列出项目文件                     |                                   |
| 调试              | (debug-on-error t)                        | 出现错误时进入调试器              | setq 变量                         |
| 调试              | (edebug-defun)                            | Instrument 当前 defun 并逐步调试 |                                   |
| 文档              | (describe-function #'foo)                 | 查看函数文档                     | C-h f                             |
| 文档              | (describe-variable 'foo)                  | 查看变量文档                     | C-h v                             |

